vintagepc/MINI404/hw/arm/prusa/stm32h503/stm32h503_rcc.c
/*
 * STM32 Microcontroller RCC (Reset and Clock Control) module
 * (STM32H503x variants)
 *
 * Copyright 2022 by VintagePC <http://github.com/vintagepc>
 *
 * Source code based on omap_clk.c
 * Implementation based on ST Microelectronics "RM0360 Reference Manual Rev 10"
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License as
 * published by the Free Software Foundation; either version 2 of
 * the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */


#include "qemu/osdep.h"
#include "hw/core/sysbus.h"
#include "qom/object.h"
#include "hw/core/qdev-properties.h"
#include "migration/vmstate.h"
#include "qemu/timer.h"
#include <stdio.h>
#include "qemu/log.h"
#include "qemu/module.h"
#include "hw/core/irq.h"
#include "qemu/units.h"
// #define STATE_DEBUG_VAR rcc_dbg
#include "../stm32_common/stm32_types.h"
#include "../utility/macros.h"
#include "../stm32_common/stm32_rcc.h"
#include "../stm32_common/stm32_rcc_if.h"
#include "../stm32_common/stm32_rcc_regdefs.h"
#include "../stm32f407/stm32_clktree.h"
#include "../stm32f407/stm32.h"
#include "../stm32_common/stm32_clk.h"
#include "../stm32_registers/generated/stm32h503/RCC_index.h"
#include "../stm32_registers/generated/stm32h503/RCC_registers.h"

/* DEFINITIONS*/

/* See README for DEBUG details. */
//#define DEBUG_STM32_RCC

#ifdef DEBUG_STM32_RCC
#define DPRINTF(fmt, ...)                                       \
do { printf("STM32F2XX_RCC: " fmt , ## __VA_ARGS__); } while (0)
#else
#define DPRINTF(fmt, ...)
#endif


QEMU_BUILD_BUG_MSG(STM32_P_COUNT>255,"Err - peripheral reset arrays not meant to handle >255 peripherals!");

static const uint8_t AHB1_PERIPHS[32] = {
    STM32_P_DMA1, STM32_P_DMA2, 0, 0, 0, 0, 0, 0,
    STM32_P_FSMC, 0, 0, 0, STM32_P_CRC, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0
};

static const uint8_t AHB2_PERIPHS[32] = {
    STM32_P_GPIOA, STM32_P_GPIOB, STM32_P_GPIOC, STM32_P_GPIOD, 0, 0, 0, STM32_P_GPIOH,
    0, 0, STM32_P_ADC1, STM32_P_DAC, 0, 0, 0, 0,
    0, STM32_P_HASH, STM32_P_RNG, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0 /*STM32_P_SRAM2*/, 0
};


static const uint8_t APB1L_PERIPHS[32] = {
    STM32_P_TIM2, STM32_P_TIM3, 0, 0, STM32_P_TIM6, STM32_P_TIM7, 0, 0,
    0, 0, 0, STM32_P_WWDG, 0, 0/*opamp*/, STM32_P_SPI2, STM32_P_SPI3,
    0 /*COMP*/, STM32_P_USART2, STM32_P_USART3, 0, 0, STM32_P_I2C1, STM32_P_I2C2, STM32_P_I3C1,
    0 /*CRS*/, 0, 0, 0, 0, 0, 0, 0
};

static const uint8_t APB1H_PERIPHS[32] = {
    0, 0, 0, 0/*DTSEN*/, 0, 0/*LP2TIM*/, 0, 0,
    0, 0/*FDCAN*/, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0
};

static const uint8_t APB2_PERIPHS[32] = {
    STM32_P_SYSCFG, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, STM32_P_TIM1, STM32_P_SPI1, 0, STM32_P_USART1, STM32_P_TIM14,
    STM32_P_TIM15, STM32_P_TIM16, STM32_P_TIM17, 0, STM32_P_ADC1, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0
};

static const uint8_t APB3_PERIPHS[32] = {
    0, 0/*SBS*/, 0, 0, 0, 0, 0/*LPUART1*/, 0,
    0, STM32_P_I3C2, 0, STM32_P_LPTIM1, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0
};

static const uint8_t (*PERIPH_BLOCKS[])[32] = {
	[RI_AHB1ENR - RI_AHB1ENR] = &AHB1_PERIPHS,
	[RI_AHB2ENR - RI_AHB1ENR] = &AHB2_PERIPHS,
	[RI_APB1LENR - RI_AHB1ENR] = &APB1L_PERIPHS,
	[RI_APB1HENR - RI_AHB1ENR] = &APB1H_PERIPHS,
	[RI_APB2ENR - RI_AHB1ENR] = &APB2_PERIPHS,
	[RI_APB3ENR - RI_AHB1ENR] = &APB3_PERIPHS,
};

// static const uint16_t AHBPRE_OPTS[16] = {
// 	[0b0000 ... 0b0111] = 1,
// 	[0b1000] = 2,
// 	[0b1001] = 4,
// 	[0b1010] = 8,
// 	[0b1011] = 16,
// 	[0b1100] = 64,
// 	[0b1101] = 128,
// 	[0b1110] = 256,
// 	[0b1111] = 512
// };

// static const uint8_t APBPRE_OPTS[8] = {
// 	[0b000 ... 0b011] = 1,
// 	[0b100] = 2,
// 	[0b101] = 4,
// 	[0b110] = 8,
// 	[0b111] = 16
// };

OBJECT_DECLARE_SIMPLE_TYPE(STM32H503_STRUCT_NAME(Rcc), STM32H503_RCC);

  	// RI_CFGR1         = 0x1C/4, /*!< RCC clock configuration register 1                   */
  	// RI_CFGR2         = 0x20/4, /*!< RCC clock configuration register 2                   */
  	// RI_PLL1CFGR      = 0x28/4, /*!< RCC PLL1 Configuration Register                      */
  	// RI_PLL2CFGR      = 0x2C/4, /*!< RCC PLL2 Configuration Register                      */
  	// RI_PLL1DIVR      = 0x34/4, /*!< RCC PLL1 Dividers Configuration Register             */
  	// RI_PLL1FRACR     = 0x38/4, /*!< RCC PLL1 Fractional Divider Configuration Register   */
  	// RI_PLL2DIVR      = 0x3C/4, /*!< RCC PLL2 Dividers Configuration Register             */
  	// RI_PLL2FRACR     = 0x40/4, /*!< RCC PLL2 Fractional Divider Configuration Register   */
  	// RI_CIER          = 0x50/4, /*!< RCC Clock Interrupt Enable Register                  */
  	// RI_CIFR          = 0x54/4, /*!< RCC Clock Interrupt Flag Register                    */
  	// RI_CICR          = 0x58/4, /*!< RCC Clock Interrupt Clear Register                   */
  	// RI_AHB1RSTR      = 0x60/4, /*!< RCC AHB1 Peripherals Reset Register                  */
  	// RI_AHB2RSTR      = 0x64/4, /*!< RCC AHB2 Peripherals Reset Register                  */
  	// RI_APB1LRSTR     = 0x74/4, /*!< RCC APB1 Peripherals reset Low Word register         */
  	// RI_APB1HRSTR     = 0x78/4, /*!< RCC APB1 Peripherals reset High Word register        */
  	// RI_APB2RSTR      = 0x7C/4, /*!< RCC APB2 Peripherals Reset Register                  */
  	// RI_APB3RSTR      = 0x80/4, /*!< RCC APB3 Peripherals Reset Register                  */
  	// RI_AHB1ENR       = 0x88/4, /*!< RCC AHB1 Peripherals Clock Enable Register           */
  	// RI_AHB2ENR       = 0x8C/4, /*!< RCC AHB2 Peripherals Clock Enable Register           */
  	// RI_APB1LENR      = 0x9C/4, /*!< RCC APB1 Peripherals clock Enable Low Word register  */
  	// RI_APB1HENR      = 0xA0/4, /*!< RCC APB1 Peripherals clock Enable High Word register */
  	// RI_APB2ENR       = 0xA4/4, /*!< RCC APB2 Peripherals Clock Enable Register           */
  	// RI_APB3ENR       = 0xA8/4, /*!< RCC APB3 Peripherals Clock Enable Register           */
  	// RI_AHB1LPENR     = 0xB0/4, /*!< RCC AHB1 Peripheral sleep clock Register             */
  	// RI_AHB2LPENR     = 0xB4/4, /*!< RCC AHB2 Peripheral sleep clock Register             */
  	// RI_APB1LLPENR    = 0xC4/4, /*!< RCC APB1 Peripherals sleep clock Low Word Register   */
  	// RI_APB1HLPENR    = 0xC8/4, /*!< RCC APB1 Peripherals sleep clock High Word Register  */
  	// RI_APB2LPENR     = 0xCC/4, /*!< RCC APB2 Peripherals sleep clock Register            */
  	// RI_APB3LPENR     = 0xD0/4, /*!< RCC APB3 Peripherals Clock Low Power Enable Register */
  	// RI_CCIPR1        = 0xD8/4, /*!< RCC IPs Clocks Configuration Register 1              */
  	// RI_CCIPR2        = 0xDC/4, /*!< RCC IPs Clocks Configuration Register 2              */
  	// RI_CCIPR3        = 0xE0/4, /*!< RCC IPs Clocks Configuration Register 3              */
  	// RI_CCIPR4        = 0xE4/4, /*!< RCC IPs Clocks Configuration Register 4              */
  	// RI_CCIPR5        = 0xE8/4, /*!< RCC IPs Clocks Configuration Register 5              */
  	// RI_BDCR          = 0xF0/4, /*!< RCC VSW Backup Domain & V33 Domain Control Register  */
  	// RI_RSR           = 0xF4/4, /*!< RCC Reset status Register                            */
  	// RI_PRIVCFGR      = 0x114/4,/*!< RCC Privilege configuration register                 */

