vintagepc/MINI404/hw/arm/prusa/stm32h503/stm32h503_rcc.c
typedef struct STM32H503_STRUCT_NAME(Rcc) {
    /* Inherited -- MUST MATCH stm32_rcc.h. NO EXCEPTIONS. */
    STM32COMRccState parent;

    /* Additional clocks */
	Clk_t
	DUMMY, /* Dummy clock that's off as a placeholder for "no clock"*/
    SYS_CK,
	SYSTICK, /* SysTick clock */
	HSI_KER_CK, /* Output from HSI DIV */
    HCLK, /* Output from AHB Prescaler */
	HCLK8, /* Output from AHB Prescaler/8 (for systick) */
	HCLK1, // AHB1 and 2 clock en/dis
	HCLK2,
	PCLK1, /* Output from APB1 Prescaler */
	PCLK2, /* Output from APB2 Prescaler */
	PCLK3, /* Output from APB3 Prescaler */
	PLL1CLK, /* Output from PLL1 */
	PLL1PCLK, /* Output from PLL1 PCLK */
	PLL1QCLK, /* Output from PLL1 QCLK */
	PLL1RCLK, /* Output from PLL1 RCLK */
	PLL2CLK, /* Output from PLL2 */
	PLL2PCLK, /* Output from PLL2 PCLK */
	PLL2QCLK, /* Output from PLL2 QCLK */
	PLL2RCLK, /* Output from PLL2 RCLK */
	RTCHSEPRE, /* Output from RTC HSE prescaler */
	TIM1PRE, /* Output from TIM1 doubler */
	TIM23PRE, /* Output from TIM23 doubler */
	AUDIOCLK,
	PER_CK,
	CSI_CK,
	HSI48_KER_CK; // For USB

// aliases for names per the clktree
#define LSE_CK parent.LSECLK
#define LSI_KER_CK parent.LSICLK
#define HSE_CK parent.HSECLK
#define HSI_CK parent.HSICLK

	/* Additional registers */

	stm32reg_h503_rcc_t regs;

	qemu_irq* hclk_upd_irq;

} STM32H503_STRUCT_NAME(Rcc);

static uint16_t h503_hclk_div_lut[0x10] = {
	[0b0000 ... 0b0111] = 1,
	[0b1000] = 2,
	[0b1001] = 4,
	[0b1010] = 8,
	[0b1011] = 16,
	[0b1100] = 64,
	[0b1101] = 128,
	[0b1110] = 256,
	[0b1111] = 512,
};

static uint8_t h503_pclk_div_lut[0x8] = {
	[0b000 ... 0b011] = 1,
	[0b100] = 2,
	[0b101] = 4,
	[0b110] = 8,
	[0b111] = 16,
};

enum sw_src
{
	SW_HSISYS,
	SW_CSI,
	SW_HSE,
	SW_PLL1,
};

enum rtc_src
{
	RTC_NONE,
	RTC_LSE,
	RTC_LSI,
	RTC_HSE,
};

enum pll_src
{
	PLL_DISABLED,
	PLL_HSI,
	PLL_CSI,
	PLL_HSE,
};

enum uart_src
{
	UART_PCLK,
	UART_PLL2Q,
	UART_HSI_KER,
	UART_CSI_KER,
	UART_LSE,
};

enum spi_src
{
	SPI_PLL1Q,
	SPI_PLL2P,
	SPI_AUDIO,
	SPI_PCLK,
};

enum i3c_sel
{
	I3C_PCLK3,
	I3C_PLL2R,
	I3C_HSI_KER,
	I3C_NONE,
};

enum i2s_sel
{
	I2S_PCLK1,
	I2S_PLL2R,
	I2S_HSI_KER,
	I2S_CSI_KER,
};

enum usb_src
{
	USB_NONE,
	USB_PLL1Q,
	USB_PLL2Q,
	USB_HSI48_KER,
};

enum systick_src
{
	SYSTICK_HCLK8,
	SYSTICK_LSI_KER_CK,
	SYSTICK_LSE_CK,
	SYSTICK_END,
};

enum analog_src
{
	ANALOG_HCLK,
	ANALOG_SYSCLK,
	ANALOG_PLL2R,
	ANALOG_HSE,
	ANALOG_KSI_KER,
	ANALOG_CSI_KER,
	ANALOG_END
};

/* REGISTER IMPLEMENTATION */
static void stm32h503_RCC_setup_pll(STM32H503_STRUCT_NAME(Rcc) *s, uint8_t pll_index)
{
	// Layout of the PLL registers is identical for both PLL1 and PLL2.
	const REGDEF_NAME(h503_rcc,pll1cfgr) *pll = (pll_index == 1 ? &s->regs.PLL1CFGR : (void*)&s->regs.PLL2CFGR);
	// const REGDEF_NAME(h503_rcc,pll1fracr) *pllfrac = (pll_index == 1 ? &s->regs.PLL1FRACR : &s->regs.PLL2FRACR);
	const REGDEF_NAME(h503_rcc,pll1divr) *plldiv = (pll_index == 1 ? &s->regs.PLL1DIVR : (void*)&s->regs.PLL2DIVR);
	Clk_t *pllclk = (pll_index == 1 ? &s->PLL1CLK : &s->PLL2CLK);
	Clk_t *pllpclk = (pll_index == 1 ? &s->PLL1PCLK : &s->PLL2PCLK);
	Clk_t *pllqclk = (pll_index == 1 ? &s->PLL1QCLK : &s->PLL2QCLK);
	Clk_t *pllrclk = (pll_index == 1 ? &s->PLL1RCLK : &s->PLL2RCLK);

	clktree_set_selected_input(pllclk, pll->bits.PLL1SRC);
	clktree_set_scale(pllclk, plldiv->bits.PLL1N + 1U, pll->bits.PLL1M);
	clktree_set_scale(pllpclk, 1, plldiv->bits.PLL1P + 1U);
	clktree_set_scale(pllqclk, 1, plldiv->bits.PLL1Q + 1U);
	clktree_set_scale(pllrclk, 1, plldiv->bits.PLL1R + 1U);
	clktree_set_enabled(pllpclk, pll->bits.PLL1PEN);
	clktree_set_enabled(pllqclk, pll->bits.PLL1QEN);
	clktree_set_enabled(pllrclk, pll->bits.PLL1REN);


}

static void stm32_rcc_RCC_CR_write(STM32H503_STRUCT_NAME(Rcc) *s, uint32_t new_value, bool init)
{
	const REGDEF_NAME(h503_rcc,cr) new = { .raw = new_value };

    if((clktree_is_enabled(&s->PLL1CLK) && !new.bits.PLL1ON && !init) &&
       s->regs.CFGR1.bits.SW == SW_PLL1) {
        printf("PLL cannot be disabled while it is selected as the system clock.");
    }

	if (new.bits.PLL1ON & !s->regs.CR.bits.PLL1ON)
	{
		stm32h503_RCC_setup_pll(s, 1);
	}
    clktree_set_enabled(&s->PLL1CLK, new.bits.PLL1ON);
	s->regs.CR.bits.PLL1RDY = s->regs.CR.bits.PLL1ON = new.bits.PLL1ON;

    if((clktree_is_enabled(&s->parent.HSECLK) && !new.bits.HSEON && !init) &&
       (s->regs.CFGR1.bits.SW == SW_HSE || s->regs.CFGR1.bits.SW == SW_PLL1)
	   // TODO - check if PLLSRC is HSE...
       ) {
        printf("HSE oscillator cannot be disabled while it is driving the system clock.");
    }
    clktree_set_enabled(&s->parent.HSECLK, new.bits.HSEON);
	s->regs.CR.bits.HSERDY = s->regs.CR.bits.HSEON = new.bits.HSEON;

	clktree_set_scale(&s->HSI_KER_CK, 1, 1U<<new.bits.HSIDIV);

    if((clktree_is_enabled(&s->parent.HSECLK) && !new.bits.HSEON && !init) &&
       (s->regs.CFGR1.bits.SW == SW_HSISYS || s->regs.CFGR1.bits.SW == SW_PLL1)
       ) {
        printf("HSI oscillator cannot be disabled while it is driving the system clock.");
    }
    clktree_set_enabled(&s->parent.HSICLK, new.bits.HSION);
	s->regs.CR.bits.HSIRDY = s->regs.CR.bits.HSION = new.bits.HSION;

	if (new.bits.PLL2ON & !s->regs.CR.bits.PLL2ON)
	{
		stm32h503_RCC_setup_pll(s, 2);
	}
	clktree_set_enabled(&s->PLL2CLK, new.bits.PLL2ON);
	s->regs.CR.bits.PLL2RDY = s->regs.CR.bits.PLL2ON = new.bits.PLL2ON;

	clktree_set_enabled(&s->CSI_CK, new.bits.CSION);
	s->regs.CR.bits.CSIRDY = s->regs.CR.bits.CSION = new.bits.CSION;

	clktree_set_enabled(&s->HSI48_KER_CK, new.bits.HSI48ON);
	s->regs.CR.bits.HSI48RDY = s->regs.CR.bits.HSI48ON = new.bits.HSI48ON;
}

static void stm32_rcc_RCC_CFGR1_write(STM32H503_STRUCT_NAME(Rcc) *s, uint32_t new_value, bool init)
{
	const REGDEF_NAME(h503_rcc,cfgr1) new = { .raw = new_value };

	clktree_set_selected_input(&s->SYS_CK, new.bits.SW);
	s->regs.CFGR1.bits.SWS = s->regs.CFGR1.bits.SW = new.bits.SW;

	// HPRE:
	clktree_set_enabled(&s->RTCHSEPRE, new.bits.RTCPRE < 2);
	clktree_set_scale(&s->RTCHSEPRE, 1, MAX(1,new.bits.RTCPRE));
	s->regs.CFGR1.bits.RTCPRE = new.bits.RTCPRE;

	if (new.bits.TIMPRE)
	{
		clktree_set_scale(&s->TIM23PRE, (s->regs.CFGR2.bits.PPRE1 > 0b101 ? 4 : 2), 1);
		clktree_set_scale(&s->TIM1PRE, (s->regs.CFGR2.bits.PPRE2 > 0b101 ? 4 : 2), 1);
	}
	else
	{
		clktree_set_scale(&s->TIM23PRE, (s->regs.CFGR2.bits.PPRE1 > 0b100 ? 2 : 1), 1);
		clktree_set_scale(&s->TIM1PRE, (s->regs.CFGR2.bits.PPRE2 > 0b100 ? 2 : 1), 1);
	}
}

static void stm32_rcc_RCC_BDCR_writeb0(STM32H503_STRUCT_NAME(Rcc) *s, uint8_t new_value, bool init)
{
	REGDEF_NAME(rcc_com,bdcr) val = {.raw = new_value};
    clktree_set_enabled(&s->parent.LSECLK, val.LSEON);
	s->regs.BDCR.bits.LSCOEN = s->regs.BDCR.bits.LSERDY = val.LSEON;


	if (s->regs.BDCR.bits.RTCSEL)
	{
		qemu_log_mask(LOG_GUEST_ERROR, "Cannot change RTC clock source after it has been set!");
	}
	else if (val.RTC_SEL == 0)
	{
		clktree_set_enabled(&s->parent.pclocks[STM32_P_RTC], 0);
	}
	else
	{
		clktree_set_enabled(&s->parent.pclocks[STM32_P_RTC], val.RTCEN);
		clktree_set_selected_input(&s->parent.pclocks[STM32_P_RTC], val.RTC_SEL - 1U );
	}

