vintagepc/MINI404/hw/arm/prusa/stm32h503/stm32h503_rcc.c
}

static void stm32_rcc_RCC_BDCR_write(STM32H503_STRUCT_NAME(Rcc) *s, uint32_t new_value, bool init)
{
    stm32_rcc_RCC_BDCR_writeb0(s, new_value & 0xff, init);
}

static uint64_t stm32_rcc_readw(void *opaque, hwaddr offset)
{
    STM32H503_STRUCT_NAME(Rcc) *s = STM32H503_RCC(opaque);
	uint32_t index = offset >> 2U;
	CHECK_BOUNDS_R(index, RI_END, stm32_h503_rcc_reginfo, "RCC");
	//rather than reconstruct the register each read, I ensure the stored value is current when changes happen.
	return s->regs.raw[index];
}

static void stm32_rcc_writeb(void *opaque, hwaddr offset, uint64_t value)
{
    STM32H503_STRUCT_NAME(Rcc) *s = STM32H503_RCC(opaque);

    switch (offset>>2U) {
    case RI_BDCR:
        stm32_rcc_RCC_BDCR_writeb0(s, value, false);
        break;
    default:
        STM32_BAD_REG(offset, 1U);
        break;
    }
}

static void stm32_rcc_writew(void *opaque, hwaddr offset,
                             uint64_t value, bool is_reset)
{
    STM32H503_STRUCT_NAME(Rcc) *s = STM32H503_RCC(opaque);

	uint8_t index = offset>>2U;

	CHECK_UNIMP_RESVD_V2(value, s->regs.raw[index], stm32_h503_rcc_reginfo, index);

    switch(index) {
        case RI_CR:
            stm32_rcc_RCC_CR_write(s, value, is_reset);
            break;
        case RI_CFGR1:
            stm32_rcc_RCC_CFGR1_write(s, value, is_reset);
            break;
		case RI_CFGR2:
			{
				const REGDEF_NAME(h503_rcc,cfgr2) new = { .raw = value };
				clktree_set_scale(&s->HCLK, 1, h503_hclk_div_lut[new.bits.HPRE]);
				clktree_set_scale(&s->PCLK1, 1, h503_pclk_div_lut[new.bits.PPRE1]);
				clktree_set_scale(&s->PCLK2, 1, h503_pclk_div_lut[new.bits.PPRE2]);
				clktree_set_scale(&s->PCLK3, 1, h503_pclk_div_lut[new.bits.PPRE3]);
				clktree_set_enabled(&s->PCLK1, !new.bits.APB1DIS);
				clktree_set_enabled(&s->PCLK2, !new.bits.APB2DIS);
				clktree_set_enabled(&s->PCLK3, !new.bits.APB3DIS);
				clktree_set_enabled(&s->HCLK1, !new.bits.AHB1DIS);
				clktree_set_enabled(&s->HCLK2, !new.bits.AHB2DIS);
				s->regs.CFGR2.raw = new.raw;
			}
			break;
        case RI_PLL1CFGR:
		case RI_PLL1DIVR:
		case RI_PLL1FRACR:
			if (s->regs.CR.bits.PLL1ON)
			{
				qemu_log_mask(LOG_GUEST_ERROR, "Cannot change PLL1 configuration while it is enabled!");
			}
			else
			{
				s->regs.raw[index] = value;
			}
			break;
        case RI_PLL2CFGR:
		case RI_PLL2DIVR:
		case RI_PLL2FRACR:
			if (s->regs.CR.bits.PLL2ON)
			{
				qemu_log_mask(LOG_GUEST_ERROR, "Cannot change PLL2 configuration while it is enabled!");
			}
			else
			{
				s->regs.raw[index] = value;
			}
			break;
            break;
		// case RI_CIER ... RI_CICR:
        case RI_CCIPR1:
			{
            	const REGDEF_NAME(h503_rcc,ccipr1) new = { .raw = value };
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_USART1], new.bits.USART1SEL);
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_USART2], new.bits.USART2SEL);
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_USART3], new.bits.USART3SEL);
				s->regs.CCIPR1.raw = new.raw;
			}
            break;
		case RI_CCIPR3:
			{
				const REGDEF_NAME(h503_rcc,ccipr3) new = { .raw = value };
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_SPI1], new.bits.SPI1SEL);
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_SPI2], new.bits.SPI2SEL);
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_SPI3], new.bits.SPI3SEL);
				s->regs.CCIPR3.raw = new.raw;
			}
			break;
		case RI_CCIPR4:
			{
				const REGDEF_NAME(h503_rcc,ccipr4) new = { .raw = value };
				clktree_set_selected_input(&s->SYSTICK, new.bits.SYSTICKSEL);
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_USBHS], new.bits.USBSEL);
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_I2C1], new.bits.I2C1SEL);
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_I2C2], new.bits.I2C2SEL);
				// clktree_set_selected_input(&s->parent.pclocks[STM32_P_I3C1], new.bits.I3C1SEL);
				// clktree_set_selected_input(&s->parent.pclocks[STM32_P_I3C2], new.bits.I3C2SEL);
				s->regs.CCIPR4.raw = new.raw;
			}
			break;
		case RI_CCIPR5:
			{
				const REGDEF_NAME(h503_rcc,ccipr5) new = { .raw = value };
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_ADC1], new.bits.ADCDACSEL);
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_DAC], new.bits.ADCDACSEL);
				clktree_set_selected_input(&s->parent.pclocks[STM32_P_RNG], new.bits.RNGSEL);
				clktree_set_selected_input(&s->PER_CK, new.bits.CKERPSEL);
				s->regs.CCIPR5.raw = new.raw;
			}
			break;
		case RI_AHB1RSTR ... RI_APB3RSTR:
			stm32_common_rcc_reset_write(&s->parent,value, PERIPH_BLOCKS[index - RI_AHB1RSTR]);
			s->regs.raw[index] = value;
			break;
		case RI_AHB1ENR ... RI_APB2ENR:
            stm32_common_rcc_enable_write(&s->parent, value, PERIPH_BLOCKS[index - RI_AHB1ENR]);
			s->regs.raw[index] = value;
            break;
		//case RI_AHB1LPENR ... RI_APB3LPENR:
		//	s->regs.raw[index] = value;
			// break;
        case RI_BDCR:
            stm32_rcc_RCC_BDCR_write(s, value, is_reset);
            break;
		case RI_RSR:
			{
				const REGDEF_NAME(h503_rcc,rsr) new = { .raw = value };
				if (new.bits.RMVF)
				{
					s->regs.RSR.raw = 0;
				}
			}
			break;
        default:
            WARN_UNIMPLEMENTED_REG(offset, write);
            break;
    }
}

static uint64_t stm32_rcc_read(void *opaque, hwaddr offset,
                               unsigned size)
{
    switch(size) {
        case 4:
            return stm32_rcc_readw(opaque, offset);
        default:
            WARN_UNIMPLEMENTED_REG(offset, read);
            return 0;
    }
}

static void stm32_rcc_write(void *opaque, hwaddr offset,
                            uint64_t value, unsigned size)
{
    switch(size) {
        case 4:
            stm32_rcc_writew(opaque, offset, value, false);
            break;
        case 1:
            stm32_rcc_writeb(opaque, offset, value);
            break;
        default:
            WARN_UNIMPLEMENTED_REG(offset,write);
            break;
    }
}

static const MemoryRegionOps stm32_rcc_ops = {
    .read = stm32_rcc_read,
    .write = stm32_rcc_write,
    .endianness = DEVICE_NATIVE_ENDIAN
};


static void stm32_rcc_reset(DeviceState *dev)
{
    STM32H503_STRUCT_NAME(Rcc) *s = STM32H503_RCC(dev);

	memset(&s->regs.raw, 0, sizeof(s->regs.raw));

	for (int i=0; i< RI_END; i++)
	{
		if (stm32_h503_rcc_reginfo[i].not_reserved)
			stm32_rcc_writew(dev, i<<2U, stm32_h503_rcc_reginfo[i].reset_val, true);
	}
}

/* IRQ handler to handle updates to the HCLK frequency.
 * This updates the SysTick scales. */
static void stm32_rcc_hclk_upd_irq_handler(void *opaque, int n, int level)
{
    STM32H503_STRUCT_NAME(Rcc) *s = (STM32H503_STRUCT_NAME(Rcc) *)opaque;

