vintagepc/MINI404/hw/arm/prusa/stm32h503/stm32h503_rcc.c
    uint32_t hclk_freq = clktree_get_output_freq(&s->HCLK);

	clock_set_hz(s->parent.CPUCLOCK, hclk_freq);
	printf("# CPUCLOCK set to %u Hz\n",hclk_freq);
	clock_propagate(s->parent.CPUCLOCK);
	clock_set_hz(s->parent.REFCLK, hclk_freq/8);
	clock_propagate(s->parent.REFCLK);
	printf("# Systick frequency (REFCLK) set to %u Hz\n", hclk_freq/8);

#ifdef DEBUG_STM32_RCC
    DPRINTF("Cortex SYSTICK frequency set to %lu Hz (scale set to %d).\n",
            (unsigned long)hclk_freq, system_clock_scale);
#endif
}



/* DEVICE INITIALIZATION */

/* Set up the clock tree */
static void stm32_rcc_realize(DeviceState *dev, Error **errp)
{
    STM32H503_STRUCT_NAME(Rcc) *s = STM32H503_RCC(dev);

	s->parent.realize_func(dev, errp);

    int i;
   	s->hclk_upd_irq =
    qemu_allocate_irqs(stm32_rcc_hclk_upd_irq_handler, s, 1);

    /* Make sure all the peripheral clocks are null initially.
     * This will be used for error checking to make sure
     * an invalid clock is not referenced (not all of the
     * indexes will be used).
     */
    for(i = 0; i < STM32_P_COUNT; i++) {
        s->parent.pclocks[i].is_initialized = false;
    }

    /* Initialize clocks */
    /* Source clocks are initially disabled, which represents
     * a disabled oscillator.  Enabling the clock represents
     * turning the clock on.
     */

	// Parent takes care of HSI (64MHz), HSE, LSI (32K), LSE(32.768KHz)

	// Primary clock sources:
	clktree_create_src_clk(&s->DUMMY, "DUMMY", 0, false);
	clktree_create_src_clk(&s->HSI48_KER_CK, "HSI48_RC", 48*MHz, false);
	clktree_create_src_clk(&s->CSI_CK, "CSI_RC", 4*MHz, false);

	clktree_create_clk(&s->SYS_CK, "SYSCLK", 1, 1, true, 250*MHz, SW_HSISYS,
						&s->parent.HSICLK, &s->CSI_CK, &s->parent.HSECLK, &s->PLL1PCLK, NULL);

	clktree_create_clk(&s->HSI_KER_CK, "HSI_KER_CK", 1, 1, true, 64*MHz, 0, &s->parent.HSICLK, NULL);

    clktree_create_clk(&s->HCLK, "HCLK", 1, 1, true, 250*MHz, 0, &s->SYS_CK, NULL);
    clktree_adduser(&s->HCLK, s->hclk_upd_irq[0]);
    clktree_create_clk(&s->HCLK8, "HCLK8", 1, 8, true, 8*MHz, 0, &s->HCLK, NULL);

	clktree_create_clk(&s->HCLK1, "HCLK1", 1, 1, true, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);
	clktree_create_clk(&s->HCLK2, "HCLK2", 1, 1, true, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK, NULL);

    clktree_create_clk(&s->PLL1CLK,  "PLL1CLK", 1, 2, true, 48*MHz, CLKTREE_NO_INPUT, &s->DUMMY, &s->parent.HSICLK, &s->CSI_CK, &s->parent.HSECLK,  NULL);
	clktree_create_clk(&s->PLL1PCLK, "PLL1P", 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PLL1CLK, NULL);
	clktree_create_clk(&s->PLL1QCLK, "PLL1Q", 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PLL1CLK, NULL);
	clktree_create_clk(&s->PLL1RCLK, "PLL1R", 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PLL1CLK, NULL);

	clktree_create_clk(&s->PLL2CLK,  "PLL2CLK", 1, 2, true, 48*MHz, CLKTREE_NO_INPUT, &s->DUMMY, &s->parent.HSICLK, &s->CSI_CK, &s->parent.HSECLK,  NULL);
	clktree_create_clk(&s->PLL2PCLK, "PLL2P", 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PLL2CLK, NULL);
	clktree_create_clk(&s->PLL2QCLK, "PLL2Q", 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PLL2CLK, NULL);
	clktree_create_clk(&s->PLL2RCLK, "PLL2R", 1, 1, false, CLKTREE_NO_MAX_FREQ, 0, &s->PLL2CLK, NULL);

	// input order needs checking
	clktree_create_clk(&s->SYSTICK, "SYSTICK", 1, 1, true, CLKTREE_NO_MAX_FREQ, 0, &s->HCLK8, &s->LSI_KER_CK, &s->LSE_CK, NULL);

	clktree_create_clk(&s->PER_CK, "PER_CK", 1, 1, true, CLKTREE_NO_MAX_FREQ, 0, &s->HSI_KER_CK, &s->CSI_CK, &s->HSE_CK, &s->DUMMY, NULL);

	// APB clocks:
	clktree_create_clk(&s->PCLK1, "PCLK1", 1, 1, true, 250*MHz, 0, &s->HCLK, NULL);
	clktree_create_clk(&s->PCLK2, "PCLK2", 1, 1, true, 250*MHz, 0, &s->HCLK, NULL);
	clktree_create_clk(&s->PCLK3, "PCLK3", 1, 1, true, 250*MHz, 0, &s->HCLK, NULL);

	// Timer doublers:
	clktree_create_clk(&s->TIM23PRE, "TIM23CLK", 2, 1, true, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK1, NULL);
	clktree_create_clk(&s->TIM1PRE, "TIM1CLK", 2, 1, true, CLKTREE_NO_MAX_FREQ, 0, &s->PCLK2, NULL);


	clktree_create_clk(&s->RTCHSEPRE, "RTCHSEPRE", 1, 1, true, 1U*MHz, 0, &s->HSE_CK, NULL);

	// IWDG comes directly from LSI:
	INIT_PCLK_NSM(IWDG, 0, &s->parent.LSICLK, NULL);

	// RTC has choices:
	INIT_PCLK_NSM(RTC, CLKTREE_NO_INPUT, &s->DUMMY, &s->LSE_CK, &s->LSI_KER_CK, &s->RTCHSEPRE, NULL);

	// PWR is directly off of SYSCLK:
	INIT_PCLK_NSM(PWR, 0, &s->SYS_CK, NULL);


    /* AHB Peripheral clocks */
	// AHB1
	INIT_PCLK_NSM(DMA1, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(DMA2, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(CRC, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(FSMC, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(BKP, 0, &s->HCLK, NULL);

	// AHB2 - GPIOs, analog, RNG and HASH:
	INIT_PCLK_NSM(GPIOA, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(GPIOB, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(GPIOC, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(GPIOD, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(GPIOH, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(ADC1, 0, &s->HCLK, &s->SYS_CK, &s->PLL2RCLK, &s->HSE_CK, &s->HSI_KER_CK, &s->CSI_CK, NULL);
	INIT_PCLK_NSM(DAC,  0, &s->HCLK, &s->SYS_CK, &s->PLL2RCLK, &s->HSE_CK, &s->HSI_KER_CK, &s->CSI_CK, NULL);
	INIT_PCLK_NSM(HASH, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(RNG, 0, &s->HSI48_KER_CK, &s->PLL1QCLK, &s->LSE_CK, &s->LSI_KER_CK, NULL);

	// AHB3
	INIT_PCLK_NSM(RCC, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(PWR, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(EXTI, 0, &s->HCLK, NULL);
	INIT_PCLK_NSM(DBG, 0, &s->HCLK, NULL);

	// Everything else is APB

	// APB1
	INIT_PCLK_NSM(TIM2, 0, &s->TIM23PRE, NULL);
	INIT_PCLK_NSM(TIM3, 0, &s->TIM23PRE, NULL);
	INIT_PCLK_NSM(TIM6, 0, &s->PCLK1, NULL);
	INIT_PCLK_NSM(TIM7, 0, &s->PCLK1, NULL);
	INIT_PCLK_NSM(WWDG, 0, &s->PCLK1, NULL);
	// opamp?
	INIT_PCLK_NSM(SPI2, 0, &s->PLL1QCLK, &s->PLL2PCLK, &s->AUDIOCLK, &s->PCLK1, NULL);
	INIT_PCLK_NSM(SPI3, 0, &s->PLL1QCLK, &s->PLL2PCLK, &s->AUDIOCLK, &s->PCLK1, NULL);
	// Comp?
	INIT_PCLK_NSM(USART2, 0, &s->PCLK1, &s->PLL1QCLK, &s->HSI_KER_CK, &s->CSI_CK, &s->LSI_KER_CK, NULL);
	INIT_PCLK_NSM(USART3, 0, &s->PCLK1, &s->PLL1QCLK, &s->HSI_KER_CK, &s->CSI_CK, &s->LSI_KER_CK, NULL);
	INIT_PCLK_NSM(I2C1, 0, &s->PCLK1, &s->PLL2RCLK, &s->HSI_KER_CK, &s->CSI_CK, NULL);
	INIT_PCLK_NSM(I2C2, 0, &s->PCLK1, &s->PLL2RCLK, &s->HSI_KER_CK, &s->CSI_CK, NULL);
	// I3C1, CRS, DTS, LPTIM2, FDCAN1

	// APB2:
	INIT_PCLK_NSM(TIM1, 0, &s->TIM1PRE, NULL);
	INIT_PCLK_NSM(SPI1, 0, &s->PLL1QCLK, &s->PLL2PCLK, &s->AUDIOCLK, &s->PCLK2, NULL);
	INIT_PCLK_NSM(USART1, 0, &s->PCLK1, &s->PLL1QCLK, &s->HSI_KER_CK, &s->CSI_CK, &s->LSI_KER_CK, NULL);
	INIT_PCLK_NSM(USBHS, 0, &s->DUMMY, &s->PLL1QCLK, &s->PLL2QCLK, &s->HSI48_KER_CK, NULL);

	// APB3: SBS, LPUART1, I3C2, LPTIM1, RTC, TAMP
	INIT_PCLK_NSM(LPTIM1, 0, &s->PCLK3, NULL);


// vf'd end

