vintagepc/MINI404/hw/arm/prusa/stm32h503/stm32h503_rcc.c
}



static void stm32_rcc_init(Object *obj)
{

    STM32H503_STRUCT_NAME(Rcc) *s = STM32H503_RCC(obj);

    STM32_MR_IO_INIT(&s->parent.iomem, obj, &stm32_rcc_ops, s, 1U * KiB);

    sysbus_init_mmio(SYS_BUS_DEVICE(obj), &s->parent.iomem);
}

static const VMStateDescription vmstate_stm32h503_rcc = {
    .name = TYPE_STM32H503_RCC,
    .version_id = 1,
    .minimum_version_id = 1,
    .fields = (VMStateField[]) {
        VMSTATE_STRUCT_ARRAY(parent.pclocks, STM32H503_STRUCT_NAME(Rcc), STM32_P_COUNT, 1, vmstate_stm32_common_rcc_clk, Clk_t),
        VMSTATE_STRUCT(SYS_CK,STM32H503_STRUCT_NAME(Rcc), 1, vmstate_stm32_common_rcc_clk, Clk_t),
        // VMSTATE_STRUCT(PLLPCLK,STM32H503_STRUCT_NAME(Rcc), 1, vmstate_stm32_common_rcc_clk, Clk_t),
        // VMSTATE_STRUCT(PLLQCLK,STM32H503_STRUCT_NAME(Rcc), 1, vmstate_stm32_common_rcc_clk, Clk_t),
        // VMSTATE_STRUCT(PLLRCLK,STM32H503_STRUCT_NAME(Rcc), 1, vmstate_stm32_common_rcc_clk, Clk_t),
        // VMSTATE_STRUCT(PLLCLK,STM32H503_STRUCT_NAME(Rcc), 1, vmstate_stm32_common_rcc_clk, Clk_t),
        // VMSTATE_STRUCT(HCLK,STM32H503_STRUCT_NAME(Rcc), 1, vmstate_stm32_common_rcc_clk, Clk_t),
        // VMSTATE_STRUCT(PCLK,STM32H503_STRUCT_NAME(Rcc), 1, vmstate_stm32_common_rcc_clk, Clk_t),
		VMSTATE_UINT32_ARRAY(regs.raw, STM32H503_STRUCT_NAME(Rcc), RI_END),
        VMSTATE_END_OF_LIST()
    }
};


static void stm32_rcc_class_init(ObjectClass *klass, const void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);
    device_class_set_legacy_reset(dc, stm32_rcc_reset);
    dc->realize = stm32_rcc_realize;
    dc->vmsd = &vmstate_stm32h503_rcc;
}

static TypeInfo stm32_rcc_info = {
    .name  = TYPE_STM32H503_RCC,
    .parent = TYPE_STM32COM_RCC,
    .instance_size  = sizeof(STM32H503_STRUCT_NAME(Rcc)),
    .class_init = stm32_rcc_class_init,
    .instance_init = stm32_rcc_init,
};

static void stm32_rcc_register_types(void)
{
    type_register_static(&stm32_rcc_info);
}

type_init(stm32_rcc_register_types)
